<?php

// PHP7/HTML5, EDGE/CHROME                                 *** Register.php ***

// ****************************************************************************
// * KwinFlat.ru                                Зарегистрировать пользователя *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  24.02.2018
// Copyright © 2018 tve                              Посл.изменение: 21.03.2018

echo 'tyuuiioio<br>';