<?php 
// PHP7/HTML5, EDGE/CHROME                              *** IniCurrStih.php ***

// ****************************************************************************
// * doortry.ru      Произвести инициализацию настроек текущего стихотворения *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  26.08.2019
// Copyright © 2019 tve                              Посл.изменение: 26.08.2019

/**
 * Так как настройка на текущее стихотворение (точнее - выбор каталога 
 * стихотворения, а в дальнейшем выбор записи из база данных с настройками 
 * текущего стихотворения) определяется по кукису, то делаем так, что если 
 * ошибочный кукис, то выбираем начальное стихотворение
**/

// ****************************************************************************
// *        Проверить соответствие стихотворения записи в базе данных         *
// ****************************************************************************
function isCurrStih($CurrStih)
{
   $Result = True;
   return $Result;
}
// ****************************************************************************
// *        Произвести инициализацию настроек текущего стихотворения          *
// ****************************************************************************
function IniCurrStih($CurrStih)
{  
   $Result = 'sorevnovanie-s-hakerami';
   if (isCurrStih($CurrStih)) $Result = $CurrStih;
   return $Result;
}
// ******************************************************** IniCurrStih.php *** 
