<?php
// PHP7/HTML5, EDGE/CHROME                            *** iniErrDoorTry.php ***
// ****************************************************************************
// * doortry.ru            Определить ошибочные сообщения и предупреждения со *
// *                                                     всех сценариев сайта *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  02.02.2020
// Copyright © 2020 tve                              Посл.изменение: 03.02.2020

// Определяем режим вывода ошибочных сообщений на страницах сайта
require_once $TPhpPrown."/TPhpPrown/iniConstMem.php";
$ModeError=rvsTriggerError; // исключение с пользовательской ошибкой  

// dispTPhpPrown:                                   Диспетчер страниц TPhpPrown
define ("InvalidLibraryPage", "Страница из библиотеки указана неверно");
define ("PageLibraryIsNot",   "Страница из библиотеки не указана в параметре");

// MakeUserError:       Cгенерировать ошибку/исключение или просто сформировать 
//                               сообщение об ошибке в системе обработки ошибок
//define ("WrongTypeError", "Неверно указан тип ошибки");
//define ("FetchStrObsolete","Устарела выборка подстроки регулярным выражением");

// ****************************************************** iniErrDoorTry.php *** 

