<?php
// PHP7/HTML5, EDGE/CHROME                                  *** IniMenu.php ***

// ****************************************************************************
// * doortry.ru                                        Отработать пункты меню *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  13.01.2019
// Copyright © 2019 tve                              Посл.изменение: 03.06.2019

// ****************************************************************************
// *                      Отработать пункты верхнего меню                     *
// ****************************************************************************
function TopMenu()
{
   $Result = true;
   ?>
      <ul>
         <li><a href="#">Простой принцип</a></li>
         <li><a href="#">SoftШутки</a></li>
         <li><a href="#">Штрихотворения</a></li>
      </ul>
   <?php
   return $Result;
}
// ****************************************************************************
// *                     Отработать пункты новостного меню                    *
// ****************************************************************************
function NewsMenu()
{
   $Result = true;
   ?>
      <ul>
         <li>Яндекс-Новости</li>
         <li>Лига-Новости</li>
         <li>Столица на онего</li>
      </ul>
   <?php
   return $Result;
}
// <!-- --> *************************************************** IniMenu.php ***
