<?php
// PHP7/HTML5, EDGE/CHROME                                  *** IniMenu.php ***

// ****************************************************************************
// * doortry.ru                                        Отработать пункты меню *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  13.01.2019
// Copyright © 2019 tve                              Посл.изменение: 05.06.2019

// ****************************************************************************
// *                      Отработать пункты верхнего меню                     *
// ****************************************************************************
function TopMenu()
{
   $Result = true;
   echo '<ul>';
      echo '<li><a href="#">Простой принцип</a></li>';
      echo "<li><a href=\"index.php?Com=Common\">Дом и квартира</a></li>";
      echo '<li><a href="##">Штрихотворения</a></li>';
      echo '<li><a href="###">Новости</a></li>';
      //echo '<li><a href="#">SoftШутки</a></li>';
   echo '</ul>';
   return $Result;
}
// ****************************************************************************
// *                     Отработать пункты новостного меню                    *
// ****************************************************************************
function NewsMenu()
{
   $Result = true;
   echo '<ul>';
   echo '<li>Яндекс-Новости</li>';
   echo '<li>Лига-Новости</li>';
   echo '<li>Столица на онего</li>';
   echo '</ul>';
   return $Result;
}
// ************************************************************ IniMenu.php ***
