<?php
// PHP7/HTML5, EDGE/CHROME                                     *** Site.php ***

// ****************************************************************************
// * doortry.ru                                        Отработать пункты меню *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  13.01.2019
// Copyright © 2019 tve                              Посл.изменение: 01.06.2019


// ****************************************************************************
// *                      Отработать пункты верхнего меню                     *
// ****************************************************************************
function IniTopMenu()
{
   $Result = true;
   ?>
      <nav class="IniTopMenu">
      <ul>
         <li><a href="#">Простой принцип</a></li>
         <li><a href="#">SoftШутки</a></li>
         <li><a href="#">Штрихотворения</a></li>
      </ul>
      </nav>
   <?php
   return $Result;
}
// <!-- --> ****************************************************** Site.php ***
