<?php
// PHP7/HTML5, EDGE/CHROME                                  *** IniMenu.php ***

// ****************************************************************************
// * doortry.ru                                        Отработать пункты меню *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  13.01.2019
// Copyright © 2019 tve                              Посл.изменение: 01.08.2019

// ****************************************************************************
// *                      Отработать пункты верхнего меню                     *
// ****************************************************************************
function TopMenu()
{
   $Result = true;
   echo '<ul>';
   // Переключаем пункты меню главных материалов сайта
   if (isComRequest('ConnHandler'))
      echo '<li><a href="index.php?Com=SimPrincip">Простой принцип программирования</a></li>';
   else
      echo '<li><a href="index.php?Com=ConnHandler">Подключить обработчик ошибок/исключений</a></li>';
   // Устанавливаем остальные пункты
   echo '<li><a href="##">Штрихотворения</a></li>';
   echo '<li><a href="">Новости</a>';
      echo '<ul>';
      echo '<li class="menuli"><a href="###">Яндекс-Новости</a></li>';
      echo '<li class="menuli"><a href="###">Лига-Новости</a></li>';
      echo '<li class="menuli"><a href="###">Столица на Онего</a></li>';
      echo '</ul>';
   echo '</li>';
   //echo '<li><a href="#">SoftШутки</a></li>';
   echo '</ul>';
   return $Result;
}
// ****************************************************************************
// *                     Отработать пункты новостного меню                    *
// ****************************************************************************
function NewsMenu()
{
   $Result = true;
   echo '<ul>';
   echo '<li>Яндекс-Новости</li>';
   echo '<li>Лига-Новости</li>';
   echo '<li>Столица на онего</li>';
   echo '</ul>';
   return $Result;
}
// ************************************************************ IniMenu.php ***
