<?php 
// PHP7/HTML5, EDGE/CHROME                             *** IniTPhpPrown.php ***

// ****************************************************************************
// * doortry.ru                    Произвести установки глобальных переменных *
// *                    для публикации на сайте функций TPhpPrown, подключить *
// *                                                  вспомогательные функции *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  10.12.2019
// Copyright © 2019 tve                              Посл.изменение: 21.12.2019

// ****************************************************************************
// *            Проинициализировать массив функций библиотеки TPhpPrown       *
// ****************************************************************************
$aTPhpPrown=array
(            
   'Findes'        => 'выбрать из строки подстроку по регулярному выражению',   
   'iniConstMem'   => 'определить общие константы и переменные',   
   'iniErrMessage' => 'определить общие сообщения библиотеки',   
   'iniRegExp'     => 'определить популярные регулярные выражения PHP',   
);
// ****************************************************************************
// *                  Вывести пункты меню по библиотеке TPhpPrown             *
// ****************************************************************************
function TPhpPrownMenu()
{
   global $aTPhpPrown;
   $Result = true;
   foreach($aTPhpPrown as $k=>$v)
   {
      if (($_SERVER['HTTP_HOST']=='doortry.ru')||($_SERVER['HTTP_HOST']=='kwinflatht.nichost.ru'))
      {
         echo '<li><a href="';
         echo '/TPhpPrown/'.prown\getTranslit($v).'"'.'>';
         echo $k.'</a></li>';
      }
      else
      {
         echo '<li><a href="';
         echo '/Pages/TPhpPrown/'.prown\getTranslit($v).'.php'.'"'.'>';
         echo $k.'</a></li>';
      }
   }
   return $Result;
}
// ******************************************************* IniTPhpPrown.php *** 
