// PHP7/HTML5, EDGE/CHROME                                   *** DoorTry.js ***

// ****************************************************************************
// * doortry.ru    Сайт сбора сообщений об ошибках/исключениях и формирования *
// *         страницы с выводом сообщений, а также комментариев для PHP5-PHP7 *
// *                          (функциональные модули обеспечения сайта на js) *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  03.06.2019
// Copyright © 2019 tve                              Посл.изменение: 29.11.2019

// Обеспечить горизонтальную прокрутку кодов и сверху, и снизу
// https://www.it-swarm.net/ru/javascript/gorizontalnaya-polosa-prokrutki-sverhu-i-snizu-tablicy/970615983/
// https://github.com/avianey/jqDoubleScroll
$(document).ready(function(){
   $('.CodeText').doubleScroll({resetOnWindowResize:true});
});
// ************************************************************* DoorTry.js ***
                             