<?php namespace prown;

// PHP7/HTML5, EDGE/CHROME                              *** iniConstMem.php ***

// ****************************************************************************
// * TPhpPrown             Определить общие константы и переменные библиотеки *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  26.02.2019
// Copyright © 2019 tve                              Посл.изменение: 21.05.2019

// ------------------------------------------------ Режимы вывода сообщений ---

define ("rvsCurrentPos",   -1);  // в текущей позиции сайта 
define ("rvsTriggerError",  0);  // исключение с пользовательской ошибкой  
define ("rvsMakeDiv",       1);  // в дополнительном div-е для сообщения   
define ("rvsDialogWindow",  2);  // в диалоговом окне с помощью JQueryUI   

// -------------------------------------------------------- Типы переменных ---

define ("tArr",   "array");    
define ("tObj",   "object");    
define ("tInt",   "integer");    
define ("tFloat", "double");    
define ("tStr",   "string");    
define ("tBool",  "boolean");    
define ("tNull",  "null");    

// ******************************************************** iniConstMem.php *** 
