<?php namespace prown;

// PHP7/HTML5, EDGE/CHROME                                *** iniRegExp.php ***

// ****************************************************************************
// * TPhpPrown                 Определить популярные регулярные выражения PHP *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  02.04.2018
// Copyright © 2018 tve                              Посл.изменение: 21.05.2019

// "должны быть и большие, и маленькие латинские буквы"
define ("regAaLatin",     '/(?=.*[a-z])(?=.*[A-Z])/');
// "должны быть не буквенно-цифровые символы"  
define ("regSigns",       "/[-!$%^&*(){}<>[\]'".'"|#@:;.,?+=_\/\~]/');
// "весь текст не более 17 символов фамилии-инициалов на русском языке (utf8)"
define ("regFamioUtf8",   "/^[А-Яа-яЁё\s\.-]{1,17}$/u");
define ("regFamio35Utf8", "/^[А-Яа-яЁё\s\.-]{1,35}$/u");
// "адрес электронной почты"
define ("regEmail",       "/^[0-9a-z_]+@[0-9a-z_^\.]+\.[a-z]{2,3}$/i");
// "десятичное число с управляемым числом знаков после запятой"
//                        "/-*[0-9]{0,}\.*[0-9]{0,".$Dec."}/"
// "целое число в тексте"
define ("regInteger",     "/[0-9]{1,}/");

// ********************************************************** iniRegExp.php ***

