<?php
// PHP7                                              *** Instrumenty.php ***

// ****************************************************************************
// * DoorTry-Instrumenty              Информационная страница об инструментах *
// *                                       разработчика сайтов и документации *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  13.05.2020
// Copyright © 2019 tve                              Посл.изменение: 16.05.2020

echo ("Информационная страница об инструментах разработчика сайтов и документации!<br>");
?>
<table>
   <caption>Инструменты и документация</caption> 
   <tr>
      <th class="first">Приложение</th>
      <th class="comment">Адрес сайта и комментарий</th>
      <th colspan="2">Документация и примеры</th>
   </tr>
   <tr>
      <td rowspan="4" class="first">jQuery</td>
      <td class="second"><a href="https://jquery.com/">https://jquery.com/</td>
      <td><a href="https://api.jquery.com/">https://api.jquery.com/</td>
      <td>Оригинальная документация по jQuery.</td>
   </tr>
   <tr>
      <td rowspan="3" class="third">jQuery это популярная библиотека JavaScript. Она была создана Джоном Резигом в 2006 году с целью облегчить разработчикам использование JavaScript на веб-сайтах. Это не отдельный язык программирования и работает в сочетании с JavaScript. С jQuery вы будете делать намного больше с меньшими затратами. Написание кода может стать утомительным, особенно если в него включено много строк. jQuery сжимает несколько строк кода в одну функцию, поэтому вам не нужно переписывать целые блоки кода для выполнения одной задачи.</td>
      <td><a href="https://jquery-docs.ru/">https://jquery-docs.ru/</td>
      <td>Русская документация по API jQuery: 
jQuery это быстрая, небольшая и богатая возможностями кросс-браузерная JavaScript библиотека. Она позволяет очень просто делать многие вещи: обход элементов или манипуляция элементами HTML документа или AJAX запросы.
На данном сайте размещен перевод официальной документации API jQuery на русский язык.</td>
   </tr>
   <tr>
      <td><a href="https://www.hostinger.ru/rukovodstva/shto-takoje-jquery/">
         https://www.hostinger.ru/rukovodstva/shto-takoje-jquery/</td>
      <td>Введение в jQuery для новичков.</td>
   </tr>
   <tr>
      <td><a href="http://uroki-jquery.ru/">http://uroki-jquery.ru/</td>
      <td>ПИШИ МЕНЬШЕ - ДЕЛАЙ БОЛЬШЕ. Практические примеры с jQuery.</td>
   </tr>
</table>
<?php
// <!-- --> *********************************************** Instrumenty.php ***
