<?php
// PHP7                                              *** Instrumenty.php ***

// ****************************************************************************
// * DoorTry-Instrumenty              Информационная страница об инструментах *
// *                                       разработчика сайтов и документации *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  13.05.2020
// Copyright © 2019 tve                              Посл.изменение: 13.05.2020

   echo ("Информационная страница об инструментах разработчика сайтов и документации!<br>");

// <!-- --> *********************************************** Instrumenty.php ***
